In [1]:
import pandas as pd

In [2]:
pd.read_excel('box_scores.xlsx')

   id         student  assignment1  assignment2  assignment3
0   1    Karen Austin           90           98           80
1   2    Matthew Ward           85           90           70
2   3    John Miranda           87           75           90
3   4    Scott Taylor           60           55           70
4   5    Tom Saunders           80           88           90
5   6  Natalie Palmer           55           70           65
6   7   James Burgess           72           70           75
7   8    Tracie Lopez           89           85           70
8   9   Donna Jimenez           91           90           98
9  10   Rachael Smith           76           66           80

### You are given a table containing assignment scores of students in a class. Write a query that identifies the largest difference in total score  of all assignments.
### Output just the difference in total score (sum of all 3 assignments) between a student with the highest score and a student with the lowest score.

In [3]:
df = pd.read_excel('box_scores.xlsx')

In [15]:
# change types of 3 assignment columns from int into str.
df['assignment1'] = df['assignment1'].astype(str)
df['assignment2'] = df['assignment2'].astype(str)
df['assignment3'] = df['assignment3'].astype(str)

In [17]:
# check the change
df['assignment1']

0    90
1    85
2    87
3    60
4    80
5    55
6    72
7    89
8    91
9    76
Name: assignment1, dtype: object

In [26]:
# create a list of all assignment scores:
total_list = []
for i in df['assignment1']:
    total_list.append(i)
for j in df['assignment2']:
    total_list.append(j)
for z in df['assignment3']:
    total_list.append(z)
    
total_list

['90',
 '85',
 '87',
 '60',
 '80',
 '55',
 '72',
 '89',
 '91',
 '76',
 '98',
 '90',
 '75',
 '55',
 '88',
 '70',
 '70',
 '85',
 '90',
 '66',
 '80',
 '70',
 '90',
 '70',
 '90',
 '65',
 '75',
 '70',
 '98',
 '80']

In [36]:
# create a new data frame from list
total_score_df = pd.DataFrame(total_list)

In [32]:
# change type from object into int
total_score_df = total_score_df.astype(int)

In [34]:
# find the max score of all assignments
total_score_df.max()

0    98
dtype: int32

In [35]:
# find the min score of all assignments
total_score_df.min()

0    55
dtype: int32

In [33]:
# final result:
total_score_df.max()-total_score_df.min()

0    43
dtype: int32